In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    'name': ['alice','bob','charlie','daniel'],
    'age': [2,15,30,70]
})
df

      name  age
0    alice    2
1      bob   15
2  charlie   30
3   daniel   70

In [3]:
df.assign(
    age_cat = lambda x : x.age.map(lambda x : 'Young' if x < 30 else 'Old')
)

      name  age age_cat
0    alice    2   Young
1      bob   15   Young
2  charlie   30     Old
3   daniel   70     Old

In [4]:
df = pd.DataFrame({
    'make': ['audi','audi','mercedes','toyota', 'honda'],
    'price': [200,200,3000,70000,5000]
})
df

       make  price
0      audi    200
1      audi    200
2  mercedes   3000
3    toyota  70000
4     honda   5000

In [5]:
german_list = ['audi', 'mercedes', 'bmw', ]
japan_list = ['toyota', 'honda', 'mazda']

conditions = [ 
    (df.make.isin(german_list)),
    (df.make.isin(japan_list)),
]

values = ['German', 'Japan']

df['make_country'] = np.select(conditions, values)
df

       make  price make_country
0      audi    200       German
1      audi    200       German
2  mercedes   3000       German
3    toyota  70000        Japan
4     honda   5000        Japan

In [6]:
German = ['audi', 'mercedes', 'bmw']
df.loc[df.make.isin(German),  'country'] = 'German'

In [7]:
df.loc[[0,3], 'price'] = 299
df

       make  price make_country country
0      audi    299       German  German
1      audi    200       German  German
2  mercedes   3000       German  German
3    toyota    299        Japan     NaN
4     honda   5000        Japan     NaN

In [8]:
df.loc[0, 'price']

299

In [9]:
df

       make  price make_country country
0      audi    299       German  German
1      audi    200       German  German
2  mercedes   3000       German  German
3    toyota    299        Japan     NaN
4     honda   5000        Japan     NaN

In [10]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [11]:
df.duplicated(keep= 'last')

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [12]:
df.duplicated(keep= 'first')

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [13]:
df.duplicated(keep= False)

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [14]:
df.duplicated(subset=['make', 'country'], keep= False)

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [15]:
df

       make  price make_country country
0      audi    299       German  German
1      audi    200       German  German
2  mercedes   3000       German  German
3    toyota    299        Japan     NaN
4     honda   5000        Japan     NaN

In [16]:
print(df.shape)
df.drop_duplicates().shape

(5, 4)

(5, 4)

In [17]:
df = pd.read_csv('auto_02.csv')
df.drop('Unnamed: 0', axis=1, inplace=True)
df.head(2)

,location,make,model,make_model,age,short_description,year,price,mileage_km,registration,...,Safety & Security,extras,colour,manufacturer_color,paint,upholstery_colour,upholstery,power_kw,power_hp,make_country
0,LOON OP ZAND,Audi,A3,Audi-A3,19.0,2.0 FSI Ambition Pro Line,2003.0,4450.0,191066.0,2003-08-01,...,"'ABS', 'Alarm system', 'Central door lock', 'C...",'Alloy wheels',Grey,None,Metallic,Black,Cloth,110.0,150.0,German
1,HEERLEN,Audi,A3,Audi-A3,9.0,Sportback 1.4 TFSI Ambiente/ECC/PDC//Lichtmeta...,2013.0,12950.0,94758.0,2013-10-01,...,"'Alarm system', 'Central door lock', 'Central ...","'Alloy wheels (16"")'",White,None,None,Black,Cloth,92.0,125.0,German

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71104 entries, 0 to 71103
Data columns (total 50 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   location                 71100 non-null  object
 1   make                     71104 non-null  object
 2   model                    71094 non-null  object
 3   make_model               71104 non-null  object
 4   age                      71054 non-null  float64
 5   short_description        70935 non-null  object
 6   year                     71054 non-null  float64
 7   price                    69534 non-null  float64
 8   mileage_km               70951 non-null  float64
 9   registration             71056 non-null  object
 10  fuel_type                71104 non-null  object
 11  seller                   71104 non-null  object
 12  body_type                71104 non-null  object
 13  type                     71104 non-null  object
 14  drivetrain               71104 non-null  object
 15  seats                    65562 non-null  float64
 16  doors                    69790 non-null  float64
 17  country_version          71104 non-null  object
 18  offer_number             71072 non-null  object
 19  warranty_months          24004 non-null  float64
 20  first_registration       71064 non-null  object
 21  production_date          7416 non-null   object
 22  general_inspection       36486 non-null  object
 23  last_service             71104 non-null  object
 24  full_service_history     71104 non-null  object
 25  non_smoker_vehicle       71104 non-null  object
 26  previous_owner           71104 non-null  object
 27  last_timing_belt_change  71104 non-null  object
 28  Gearbox                  71104 non-null  object
 29  engine_size_cc           65265 non-null  float64
 30  gears                    71104 non-null  object
 31  cylinders                64809 non-null  float64
 32  empty_weight_kg          69500 non-null  float64
 33  Fuel_type                71104 non-null  object
 34  fuel_consumption         62871 non-null  object
 35  co2_emissions_g_km_comb  52190 non-null  float64
 36  emission_class           71104 non-null  object
 37  emissions_sticker        71104 non-null  object
 38  Comfort & Convenience    71104 non-null  object
 39  Entertainment & Media    71104 non-null  object
 40  Safety & Security        71104 non-null  object
 41  extras                   71104 non-null  object
 42  colour                   71104 non-null  object
 43  manufacturer_color       71104 non-null  object
 44  paint                    71104 non-null  object
 45  upholstery_colour        71104 non-null  object
 46  upholstery               71104 non-null  object
 47  power_kw                 65045 non-null  float64
 48  power_hp                 65041 non-null  float64
 49  make_country             71104 non-null  object
dtypes: float64(13), object(37)
memory usage: 27.1+ MB

In [19]:
df.duplicated(keep= False).sum()

3995

In [20]:
df.duplicated(subset=['make_model', 'year', 'mileage_km','price', 'short_description' ]).sum()

3123

In [21]:
df.loc[df.duplicated(keep=False), :].head(6)

,location,make,model,make_model,age,short_description,year,price,mileage_km,registration,...,Safety & Security,extras,colour,manufacturer_color,paint,upholstery_colour,upholstery,power_kw,power_hp,make_country
415,ROTTERDAM,Audi,A3,Audi-A3,12.0,1.4 TFSI S-edition,2010.0,6749.0,220000.0,2010-03-01,...,"'Central door lock with remote control', 'Dayt...","'Alloy wheels', 'Roof rack', 'Spoiler', 'Sport...",Black,None,None,Black,Partleather,92.0,125.0,German
604,ZUILICHEM,Audi,A1,Audi-A1,10.0,1.2 TFSI Connect 2012 Airco Navigatie Cruise C...,2012.0,5950.0,291473.0,2012-01-01,...,"'ABS', 'Central door lock', 'Central door lock...","'Alloy wheels (16"")'",Black,None,None,None,None,63.0,86.0,German
607,GORINCHEM,Audi,A1,Audi-A1,12.0,1.2 TFSI Attraction Airco,2010.0,5950.0,221136.0,2010-12-01,...,"'ABS', 'Alarm system', 'Central door lock', 'C...",'Alloy wheels',White,None,None,None,Cloth,63.0,86.0,German
625,OOSTDIJK,Audi,A3,Audi-A3,13.0,1.4 TFSI Attraction,2009.0,5700.0,200250.0,2009-04-01,...,"'ABS', 'Central door lock with remote control'...","'Alloy wheels (16"")', 'Spare tyre', 'Trailer h...",Blue,None,Metallic,Blue,Cloth,92.0,125.0,German
635,WOMMELS,Audi,A3,Audi-A3,16.0,1.6 FSI Ambiente,2006.0,2750.0,289500.0,2006-11-01,...,"'Central door lock', 'Central door lock with r...","'Alloy wheels (16"")', 'Automatically dimming i...",Blue,None,None,None,None,85.0,116.0,German
638,WOMMELS,Audi,A3,Audi-A3,16.0,1.6 FSI Ambiente,2006.0,2750.0,289500.0,2006-11-01,...,"'Central door lock', 'Central door lock with r...","'Alloy wheels (16"")', 'Automatically dimming i...",Blue,None,None,None,None,85.0,116.0,German

In [22]:
df.duplicated().sum()

2012

In [23]:
df.duplicated(keep ='last').sum()

2012

In [24]:
df = pd.DataFrame({
    'make': ['audi','audi','audi','mercedes','toyota', 'honda'],
    'price': [200,200,200,3000,70000,5000]
})
df

       make  price
0      audi    200
1      audi    200
2      audi    200
3  mercedes   3000
4    toyota  70000
5     honda   5000

In [25]:
df.duplicated().sum()

2

In [26]:
df.duplicated(keep= False)

0     True
1     True
2     True
3    False
4    False
5    False
dtype: bool

In [27]:
df.duplicated(keep= False).sum()

3

In [29]:
df.loc[df.duplicated(keep = False), :]

   make  price
0  audi    200
1  audi    200
2  audi    200

In [32]:
df.loc[df.duplicated() , :]

   make  price
1  audi    200
2  audi    200